In [1]:
import pandas as pd

In [2]:
data = {
    'nombre': ['Juan', 'Ana', 'Luis', 'María', 'Pedro'],
    'apellido': ['Pérez', 'López', 'González', 'Rodríguez', 'Martínez'],
    'edad': [30, 28, 40, 35, 45],
    'salario': [50000, 55000, 70000, 65000, 80000],
    'departamento': ['Ventas', 'Marketing', 'Finanzas', 'Ventas', 'Recursos Humanos']
}

df = pd.DataFrame(data)
display(df)

  nombre   apellido  edad  salario      departamento
0   Juan      Pérez    30    50000            Ventas
1    Ana      López    28    55000         Marketing
2   Luis   González    40    70000          Finanzas
3  María  Rodríguez    35    65000            Ventas
4  Pedro   Martínez    45    80000  Recursos Humanos

In [4]:
! pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.32-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (9.6 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/jorge/Programs/numpi-python/env/lib/python3.12/site-packages (from sqlalchemy) (4.12.2)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Using cached greenlet-3.0.3-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl.metadata (3.8 kB)
Downloading SQLAlchemy-2.0.32-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.2 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.2/3.2 MB 3.5 MB/s eta 0:00:00[31m3.8 MB/s eta 0:00:010m
Using cached greenlet-3.0.3-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (625 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.0.3 sqlalchemy-2.0.32

[notice] A new release of pip is available: 24.1.1 -> 24.2
[notice] To update, run: pip install --upgrade pip

In [5]:
from sqlalchemy import create_engine

In [6]:
engine = create_engine('sqlite:///empleados.db')

In [7]:
df.to_sql('empleados', con=engine, if_exists='replace', index=False)

5

In [9]:
result_df = pd.read_sql('SELECT * FROM empleados', con=engine)
display(result_df)

  nombre   apellido  edad  salario      departamento
0   Juan      Pérez    30    50000            Ventas
1    Ana      López    28    55000         Marketing
2   Luis   González    40    70000          Finanzas
3  María  Rodríguez    35    65000            Ventas
4  Pedro   Martínez    45    80000  Recursos Humanos

In [12]:
query = '''
SELECT nombre, apellido, salario
FROM empleados
WHERE salario > 60000
'''

In [13]:
result_df_filtered = pd.read_sql(query, con=engine)
display(result_df_filtered)

  nombre   apellido  salario
0   Luis   González    70000
1  María  Rodríguez    65000
2  Pedro   Martínez    80000